app/Models/AccountModel.php

SELECT *
FROM `account`
---
    public function getAdmin($id_account = false)
    {
        if ($id_account == false) {
            return $this->findAll();