app/Models/JabatanModel.php

    public function getDivision()
    {
        return $this->where(['id_parent' => null])->findAll();
---
SELECT *
FROM `jabatan`
WHERE `id_parent` IS NULL