app/Models/TicketModel.php

    public function getTicket($id_ticket = false)
    {
        if ($id_ticket == false) {
            return $this->findAll();
        }

        return $this->where(['id_ticket' => $id_ticket])->first();
---
SELECT *
FROM `ticket`
SELECT *
FROM `ticket`
WHERE `id_ticket` = '10'
 LIMIT 1

    public function getTicketStatus($ticketStatus, $form)
    {
        if (empty($form)) {
            return $this->where(['status' => $ticketStatus])->findAll();
---
SELECT *
FROM `ticket`
WHERE `status` = 'DELETED'